In [49]:
import pandas as pd

In [50]:
df = pd.DataFrame({'국어':[90, 85, 88],
                   '수학':[92, 88, 96],
                   '과학':[85, 92, 90]},
                   index = ['A','B','C'])
df

   국어  수학  과학
A  90  92  85
B  85  88  92
C  88  96  90

## 1. 행에 접근
- loc( ) : 인덱스의 이름을 인수로 받음
- iloc( ) : 인덱스의 순서를 인수로 받음(0,1,2...)

In [51]:
df.loc['A']

국어    90
수학    92
과학    85
Name: A, dtype: int64

In [52]:
df.iloc[2]

국어    88
수학    96
과학    90
Name: C, dtype: int64

## 2. 행/열에 접근

### 2.1. loc
- loc( ) 함수를 사용하는 경우에는 꼭 행/열의 이름을 인수로 넣어야 한다!!
- A:B 형태로 슬라이싱 할때 A,B가 character이면 B도 포함된다.

In [8]:
df.loc[:, '수학':'과학']

   수학  과학
A  92  85
B  88  92
C  96  90

In [12]:
df.loc['A':'B', '국어':'수학']

   국어  수학
A  90  92
B  85  88

In [15]:
df.loc[['A','C'], ['국어','과학']]

   국어  과학
A  90  85
C  88  90

🌵 df.loc[df[column] ~조건, 열]

In [17]:
df.loc[df['수학'] >= 90, ['수학','과학']]

   수학  과학
A  92  85
C  96  90

In [41]:
df.loc[df['수학'] >= 90, '국어':'수학']

   국어  수학
A  90  92
C  88  96

### 2.2. iloc
- iloc( ) 함수를 사용하는 경우에는 꼭 행/열의 순서를 인수로 넣어야 한다!!
- A:B 형태로 슬라이싱 할때 A,B가 numeric이면 B는 제외된다.

In [11]:
df.iloc[:, [1,2]]

   수학  과학
A  92  85
B  88  92
C  96  90

In [36]:
df.iloc[:2, :2]

   국어  수학
A  90  92
B  85  88

In [37]:
df.iloc[0:2, [0,2]]

   국어  과학
A  90  85
B  85  92